NixOSConfiguration.org
* Header                                                             :noexport:
# -*- mode: org; -*-
# (my/execute-startup-blocks)

#+TITLE: My NixOS Config Setup
#+AUTHOR: Curtis D'Alves
#+EMAIL: curtis.dalves@gmail.com
#+DESCRIPTION: My NixOS Configuration File, Written in Org-mode.
#+STARTUP: indent lognoteclock-out
#+OPTIONS: html-postamble:nil toc:nil d:nil num:nil :results nil
#+PROPERTY: header-args :tangle init.el :comments link :results none

* Abstract :ignore:
  :PROPERTIES:
  :CUSTOM_ID: Abstract
  :END:

  This is my literate [[nixos.org/manual/nixos/stable][NixOS]] configuration.

* Table of Contents                                            :Github:TOC_4:
  :PROPERTIES:
  :CUSTOM_ID: Table-of-Contents
  :END:
- [[#abstract][Abstract]]
- [[#installing-nixos][Installing NixOS]]
  - [[#formatting-for-luks-encryption-on-btrfs][Formatting for LUKS Encryption on BTRFS]]
  - [[#generate-config][Generate Config]]
  - [[#install][Install]]
  - [[#post-install][Post-Install]]
- [[#setting-up-your-config-files][Setting Up Your Config Files]]
  - [[#choosing-a-channel][Choosing a Channel]]
  - [[#multi-system-file-layout][Multi-System File Layout]]
  - [[#building-this-document][Building This Document]]
- [[#template][Template]]
- [[#imports][Imports]]
- [[#overlays][Overlays]]
- [[#system-packages][System Packages]]
- [[#boot-loader][Boot loader]]
  - [[#supporting-btrfs-and-ntfs-file-system][Supporting BTRFS and NTFS File System]]
  - [[#disable-ertm][Disable ertm]]
- [[#kernel][Kernel]]
  - [[#kernel-modules][Kernel Modules]]
- [[#virtual-box][Virtual Box]]
- [[#system-settings][System Settings]]
  - [[#timezone][TimeZone]]
  - [[#locale][Locale]]
  - [[#allow-proprietary-software][Allow Proprietary Software]]
  - [[#fonts][Fonts]]
  - [[#keyboard-layout][Keyboard Layout]]
  - [[#swap-control-and-caps][Swap Control and Caps]]
  - [[#global-environment-variables][Global Environment Variables]]
  - [[#systemd][Systemd]]
- [[#cron][Cron]]
- [[#openssh][OpenSSH]]
- [[#networking][Networking]]
  - [[#firewall][Firewall]]
- [[#graphics][Graphics]]
  - [[#nvidia][Nvidia]]
  - [[#nvidia-prime][Nvidia Prime]]
- [[#desktop-environment][Desktop Environment]]
  - [[#gnome-3][Gnome 3]]
  - [[#kde-plasma5][KDE Plasma5]]
  - [[#none--xmonad][None + Xmonad]]
- [[#bluetooth][Bluetooth]]
- [[#sounds-settings][Sounds Settings]]
- [[#touchpad-support][TouchPad support]]
  - [[#xbox-controller-support][Xbox controller support]]
- [[#shell-environment][Shell Environment]]
- [[#users-management][Users Management]]
- [[#open-razer][Open Razer]]
- [[#emacs-daemon][Emacs Daemon]]
- [[#steam][Steam]]
- [[#gamemode][Gamemode]]
- [[#dropbox][Dropbox]]
- [[#noisetorch][NoiseTorch]]
- [[#nixconf][Nix.conf]]
- [[#nix-extra-options][Nix Extra Options]]
- [[#nix-permitted-insecure-packages][Nix Permitted Insecure Packages]]
- [[#system-upgrades][System Upgrades]]
- [[#opt-in-state][Opt-In State]]
  - [[#figuring-out-what-to-persist][Figuring out what to Persist]]
  - [[#persisting-files-removed][Persisting Files #REMOVED]]
    - [[#persisting-machine-id][Persisting Machine-ID]]
  - [[#root-rollback-removed][Root Rollback #REMOVED]]
  - [[#copying-files-to-persist][Copying Files to Persist]]
- [[#home-manager][Home Manager]]
  - [[#shell-configuration][Shell Configuration]]
    - [[#shell-aliases][Shell Aliases]]
  - [[#alacritty][Alacritty]]
  - [[#nix-direnv][Nix-Direnv]]
  - [[#dconf-config-gnome][dconf Config (Gnome)]]
  - [[#xmonad--kde-removed][XMonad + KDE #REMOVED]]
  - [[#xmonad--none-removed][XMonad + None #REMOVED]]
  - [[#picom-removed][Picom #REMOVED]]
  - [[#gtk-theme-removed][GTK Theme #REMOVED]]
  - [[#vs-code][VS Code]]
  - [[#keyboard-layout-1][Keyboard Layout]]
  - [[#rofi-removed][Rofi #REMOVED]]
  - [[#polybar-removed][Polybar #REMOVED]]
  - [[#dunst-removed][Dunst #REMOVED]]

* Installing NixOS 
The installation part of the [[https://nixos.org/manual/nixos/stable/index.html#ch-installation][NixOS Manual]] describes how to perform a standard
installation better than I can

** Formatting for LUKS Encryption on BTRFS
There's a pretty good [[https://mt-caret.github.io/blog/posts/2020-06-29-optin-state.html][blog post on Encrypted BTRFS Root with Opt-in State in
NixOS]] covering how to do this. 

- First partition an EFI partition, swap and root
  partition (where ~/dev/sda~ is the disk you've chosen to install on, you can
  check your disks with ~fdisk -l~)
  #+BEGIN_SRC shell :tangle no
  parted /dev/sda -- mklabel gpt
    # make root
  parted /dev/sda -- mkpart primary 512MiB -8GiB
    # make swap
  parted /dev/sda -- mkpart primary linux-swap -8GiB 100%
    # make boot
  parted /dev/sda -- mkpart ESP fat32 1MiB 512MiB
  parted /dev/sda -- set 3 esp on
  #+END_SRC
- Then encrypt the root partition (~/dev/sda1~ in this example)  with [[https://wiki.archlinux.org/index.php/Dm-crypt][dm-crypt]]
  #+BEGIN_SRC shell :tangle no
  cryptsetup --verify-passphrase -v luksFormat /dev/sda1
  cryptestup open /dev/sda1 enc
  #+END_SRC
- Then format each partition (assuming ~/dev/sda2~ is swap and ~/dev/sda3~ is boot)
  #+BEGIN_SRC shell :tangle no
  mkfs.vfat -n boot /dev/sda3 
  mkswap /dev/sda2
  swapon /dev/sda2
  mkfs.btrfs /dev/mapper/enc
  #+END_SRC
- Next, create the btrfs subvolumes. You can play around with this, this example
  creates a persist subvolume and makes blank snapshot of root to do *Opt-In
  State* (see the section [[#opt-in-state][Opt-In State]])
  #+BEGIN_SRC shell :tangle no
  mount -t btrfs /dev/mapper/enc /mnt

  btrfs subvolume create /mnt/root
  btrfs subvolume create /mnt/home
  btrfs subvolume create /mnt/nix
  btrfs subvolume create /mnt/persist
  btrfs subvolume create /mnt/log

  # We then take an empty *readonly* snapshot of the root subvolume,
  # which we'll eventually rollback to on every boot.
  btrfs subvolume snapshot -r /mnt/root /mnt/root-blank

  umount /mnt
  #+END_SRC
- Now we need to mount all our subvolumes so that a proper fstab gets generated
  for when we finally run ~nixos-build~
  #+BEGIN_SRC shell :tangle no
  mount -o subvol=root,compress=zstd,noatime /dev/mapper/enc /mnt

  mkdir /mnt/home
  mount -o subvol=home,compress=zstd,noatime /dev/mapper/enc /mnt/home

  mkdir /mnt/nix
  mount -o subvol=nix,compress=zstd,noatime /dev/mapper/enc /mnt/nix

  mkdir /mnt/persist
  mount -o subvol=persist,compress=zstd,noatime /dev/mapper/enc /mnt/persist

  mkdir -p /mnt/var/log
  mount -o subvol=log,compress=zstd,noatime /dev/mapper/enc /mnt/var/log
  #+END_SRC
- Also don't forget to mount your boot partition (assuming ~/dev/sda3~ is boot
  partition)
  #+BEGIN_SRC shell :tangle no
  mkdir /mnt/boot
  mount /dev/sda3 /mnt/boot
  #+END_SRC
  
** Generate Config
After you're done partitioning, formatting and everything is mounted (with root
at ~/mnt~ of course)
- Generate a default nixos configuration file int ~/mnt/etc/nixos~ with
  #+BEGIN_SRC shell :tangle no
  nixos-generate-config --root /mnt
  #+END_SRC
- Then edit ~/mnt/etc/nixos/configuration~ to configure your system, I recommend
  starting with a minimalist install until you can actually boot into your
  system
- The [[https://nixos.org/manual/nixos/stable/index.html#ch-installation][NixOS Manual]] gives a good overview of the essentials you should configure,
  but here's a good sample inital configuration for an EFI system with a btrfs root
  #+BEGIN_SRC nix :tangle no
  { config, pkgs, ... }:

  {
    imports =
      [ # Include the results of the hardware scan.
        ./hardware-configuration.nix
      ];

    boot.supportedFilesystems = [ "btrfs" ];
    boot.loader.systemd-boot.enable = true;
    boot.loader.efi.canTouchEfiVariables = true;

    hardware.enableAllFirmware = true;
    nixpkgs.config.allowUnfree = true;

    networking.hostName = "NixBoot"; # Define your hostname.
    networking.networkmanager.enable = true;

    time.timeZone = "America/Toronto";

    networking.useDHCP = false;
    networking.interfaces.enp0s31f6.useDHCP = true; # this should be generated for you
    networking.interfaces.wlp82s0.useDHCP = true;   # need to manually turn on any network interfaces

    i18n.defaultLocale = "en_US.UTF-8";
    console = {
      font = "sun12x22";
      keyMap = "us";
    };

    services.xserver.enable = true;
    services.xserver.displayManager.sddm.enable = true;
    services.xserver.desktopManager.plasma5.enable = true;

    sound.enable = true;
    hardware.pulseaudio.enable = true;

    services.xserver.libinput.enable = true;

    users.users.dalvescb = {
      isNormalUser = true;
      extraGroups = [ "wheel" ]; # Enable ‘sudo’ for the user.
    };

    environment.systemPackages = with pkgs; [
      wget 
      vim
      emacs
      chromium
      git
    ];
  
    services.openssh.enable = true;
    system.stateVersion = "20.09"; # Did you read the comment?

    }
    #+END_SRC
  - Also make sure everything in ~/mnt/etc/nixos/hardware-configuration.nix~ is
    correct, in particular if you followed the btrfs file layout in the previous
    section make sure ~/var/log~ subvolume is mounted early enough in the boot
    process by adding ~neededForBoot = true~, i.e.
    #+BEGIN_SRC nix :tangle no
    fileSystems."/var/log" =
      { device = "/dev/disk/by-uuid/f73c53b7-ae6c-4240-89c3-511ad918edcc";
        fsType = "btrfs";
        options = [ "subvol=log" "compress=zstd" "noatime" ];
        neededForBoot = true;
      };
  #+END_SRC
  
** Install
Finally, after you've you have generated and edited your configuration, simply
run
#+BEGIN_SRC shell :tangle no
nixos-install
reboot
#+END_SRC

** Post-Install
After a successful installation you should 
- begin properly configuring ~/mnt/etc/nixos/configuration~
- if you followed the btrfs subvolume setup in [[#formatting-for-luks-encryption-on-btrfs][Formatting for LUKS Encryption on
  BTRFS]] optionally enable [[#opt-in-state][Opt-In State]]
  
* Setting Up Your Config Files
[[#building-this-document][Building This Document]] will generate a file ~common-configuration.nix~, which is
designed to be imported by your main ~configuration.nix~ that will contain any
system specific information so that the majority of your config can be shared by
multiple systems 

** Choosing a Channel
NixOS will default to the most recent stable channel (at the time of writing
this 20.09). To list the current channel you're on
#+BEGIN_SRC shell :tangle no
sudo nix-channel --list
  nixos https://nixos.org/channels/nixos-20.09
#+END_SRC
I use the nixos-unstable channel (it's not really that unstable, and makes NixOS
more of a rolling-release distro like Arch). Switch channels with
#+BEGIN_SRC shell :tangle no
sudo nix-channel --add https://nixos.org/channels/nixos-unstable nixos
sudo nix-channel --update
#+END_SRC
and then rebuild and upgrade (you should upgrade every time you do a nix-channel update)
#+BEGIN_SRC shell :tangle no
sudo nixos-rebuild switch --upgrade
#+END_SRC

** Multi-System File Layout
- Clone this repository to your home, i.e. if ~<user>~ is your username:
  ~/home/<user>/nixconfig~
- Create a new directory in the repo to store system specific configuration
  files, i.e. if <hostname> is your hostname create the directory:
  ~/home/<user>/nixconfig/<hostname>~
- Copy your generated ~/etc/nixos/hardware-configuration.nix~ into
  ~/home/<user>/nixconfig/<hostname>~
- Create a main configuration file
  ~/home/<user>/nixconfig/<hostname>/configuration.nix~ which will import the
  other configurations and contain any system specific config, for example:
  #+BEGIN_SRC nix :tangle no

  {
    imports =
      [ 
        ./hardware-configuration.nix
        ../common-configuration.nix
        ./user-configuration.nix
      ];

    networking.hostName = "<hostname>"; # replace with actual hostname
    nix.nixPath = [
      "home-manager=/nix/var/nix/profiles/per-user/root/channels/home-manager"
      "nixpkgs=/nix/var/nix/profiles/per-user/root/channels/nixos/nixpkgs"
      "nixos-config=/home/<user>/nixconfig/${config.networking.hostName}/configuration.nix"
    ];


    networking.useDHCP = false;
    networking.interfaces.<interface>.useDHCP = true; # replace wiht actual networking interfaces

    fileSystems."/var/log".neededForBoot = true;
  }
  #+END_SRC
- Create a ~/home/<user>/nixconfig/<hostname>/user-configuration.nix~ and setup
  your user configuration (see [[#users-management][Users Management]])

- ~nix.nixPath~ will change your default ~nixo-config~ path from ~/etc/nixos~,
  but the first time you rebuild you'll have to specify this manually, i.e.
  #+BEGIN_SRC shell :tangle no
  nixos-rebuild -I /home/<user>/nixconfig/<hostname>/configuration.nix switch
  #+END_SRC
  
** Building This Document
This is an Emacs [[https://orgmode.org][Org Mode]] document, and thus needs emacs to be
built. However, on a fresh NixOS installation you can build this from a
temporary shell environment via
#+BEGIN_SRC sh :tangle no :results output silent 
nix-shell -p emacs
emacs --file NixOSConfiguration.org --eval '(progn (org-babel-tangle) (kill-emacs))'
#+END_SRC
However, I recommend you first do a basic install as laid out in [[#installing-nixos][Installing
NixOS]], then using ~org-babel-tangle~ from within emacs.

* Template
  - The NixOS configuration file is actually a /Nix expression/, which is the Nix
    package manager's purely functional language for describing how to build
    packages.
  - The first line (~{ config, pkgs, ... }~) denotes that  this is actually a
    function that takes at least two arguments ~config~ and ~pkgs~. The function
    returns a set of *option definitions* ~{ <<insert-config-here>> }~ (i.e. where
    the entirety of the configuration code in this document is inserted)
    
    #+BEGIN_SRC nix :tangle common-configuration.nix :noweb yes
    # Edit this configuration file to include configuration common between hosts
    # NOTE this was generated from the org file NixOSConfiguration.org
    { config, pkgs, ... }:

    {
      <<insert-config-here>>
    }
    #+END_SRC
    
* Imports
Import other modules (and [[https://nix-community.github.io/home-manager/index.html#sec-install-nixos-module][Home Manager]]) here
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
imports = [ <home-manager/nixos> ];
#+END_SRC
*NOTE* to import home-manager this way you need to add it to nix channels with
#+BEGIN_SRC shell :tangle no
sudo nix-channel --add https://github.com/nix-community/home-manager/archive/master.tar.gz home-manager
sudo nix-channel --update
#+END_SRC
Also make sure home-manager is in your ~NIX_PATH~ variable (see [[#multi-system-file-layout][Multi-System
File Layout]] for an example of how/where to set it)

