NixOSConfiguration.org
* Overlays
Overlays provide a method to extend and change the imported nixpkgs. See
[[https://nixos.wiki/wiki/Overlays][Overlays]] for details

#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
nixpkgs.overlays = let
  # this overlay is just a tmp fix for a steam update issue, track here https://github.com/ValveSoftware/steam-runtime/issues/462
  # remove me when the issue is fixed
  steam-overlay =(self: super: { steam = super.steam.override { extraPkgs = pkgs: with pkgs; [ pango harfbuzz libthai ]; }; } ) ;
  plasma-framework-overly = (final: prev:
    let
      libsForQt5 = prev.libsForQt5.overrideScope' (
        finalx: prevx:
        let
          kdeFrameworks = prevx.kdeFrameworks.overrideScope' (
            finaly: prevy: {
              plasma-framework = prevy.plasma-framework.overrideAttrs (oldAttrs:
                rec {
                  # NOTE update me as nixpkgs gets updated, see
                  # nixpkgs/pkgs/development/libraries/kde-frameworks/srcs.nix to see current version
                  # and apply fixes in https://github.com/xmonad/xmonad/issues/174
                  src = pkgs.fetchurl {
                    url = "https://github.com/dalvescb/plasma-framework/archive/refs/tags/xmonad-5.90.tar.gz";
                    sha256 = "sha256-8EoNNnSW6nxwyc5h/vR6BnF71c3J2WlZL1ivHfcGsWI=";
                    name = "plasma-framework-5.90.0.tar.gz";
                  };
                });
            });
          plasma5 = prevx.plasma5;
          kdeGear = prevx.kdeGear;
          all = kdeFrameworks // plasma5 // plasma5.thirdParty // kdeGear;
          libsForQt5 = all // {
            inherit kdeFrameworks plasma5 kdeGear;
            kdeApplications = kdeGear;
          };
        in libsForQt5 // {
          inherit libsForQt5;
        });
    in { inherit libsForQt5;
          inherit (libsForQt5) plasma-desktop;
          plasma5Packages = libsForQt5;
        }
  );
  hls-overlay = (self: super:
    let
      disableCabalFlag = super.haskell.lib.disableCabalFlag;

      hslWithoutPlugins = super.haskellPackages.haskell-language-server.override  {
        hls-fourmolu-plugin = null;
        hls-ormolu-plugin = null;
        # supportedGhcVersions = [ "884" "8107" "90" ];
      };
      withoutFourmoluFlag = disableCabalFlag hslWithoutPlugins "fourmolu";
      hls = disableCabalFlag withoutFourmoluFlag "ormolu";
    in { haskell-language-server = hls;  } );
# in [ plasma-framework-overly ];
in [ ];  # use no overlays atm
#+END_SRC

* System Packages
Install packages system-wide by adding them to ~environment.systemPackages~.
*NOTE* multiple declarations (between modules) will result in /merging/ of this
list, so not necessarily all installed system packages need to be located here
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
environment.systemPackages = with pkgs; [
  wget
  ispell
  vim
  emacs
  git
  imagemagick
  subversion
  firefox-bin
  chromium
  brave
  discord
  nix-index
  libva
  libva-utils
  razergenie
  linuxPackages_5_15.openrazer
  pciutils
  arc-kde-theme
  # plasma5.kwallet-pam
  # plasma5.sddm-kcm
  haskellPackages.stack
  (haskell-language-server.override { supportedGhcVersions = [ "902" "924" ]; })
  # haskell-language-server
  haskellPackages.Agda
  haskellPackages.implicit-hie
  cabal-install
  ghc
  python3Full
  snapper
  python38Packages.setuptools
  # emacs26Packages.agda2-mode
  agda
  agda-pkg
  texlive.combined.scheme-full
  # alacritty
  libsForQt5.ark
  zip
  unzip
  unrar
  mattermost-desktop
  slack
  teams
  zoom-us
  snapper
  # steam
  # steam-run
  chntpw
  ntfs3g
  libsForQt5.plasma-integration
  libsForQt5.plasma-browser-integration
  # libsForQt5.kdeconnect-kde
  libsForQt5.okular
  xorg.xkill
  htop
  linuxPackages_5_15.xpadneo
  gsmartcontrol
  smartmontools
  pkg-config
  alsa-lib
  xorg.xrandr
  arandr
  killall
  libnotify
  jupyter
  pandoc
  libreoffice
  rnnoise-plugin
  noisetorch
  vulkan-tools
  vulkan-loader
  vulkan-validation-layers
  python311Packages.pygments
  ipopt
  docker
  # haskell.packages.ghc883.haskell-language-server
  glmark2
  ripgrep
  ripgrep-all
  # dropbox - we don't need this in the environment. systemd unit pulls it in
  dropbox-cli
  nodePackages.mermaid-cli
  graphviz
  xdot
  haskellPackages.graphmod
  obs-studio
  vlc
  haruna
  mkvtoolnix
  niv
  shotcut
  gnome.nautilus
  gnome.sushi
  scrot
  btop
  lm_sensors
  xsensors
  hddtemp
  kde-gtk-config
  arc-theme
  materia-theme
  orchis-theme
  libsForQt5.knotifications
  libsForQt5.sddm-kcm
  libsForQt5.konqueror
  rnix-lsp
  spotify
  webtorrent_desktop
  transmission-qt
  kgraphviewer
  libgtop
  etcher
  openrgb
  poppler
  ditaa
  texlab
  ltex-ls
  html-tidy
  dolphin-emu
  gnome-icon-theme
  gnome.gnome-tweaks
  gnome.dconf-editor
  gnomeExtensions.appindicator
  gnomeExtensions.just-perfection
  gnomeExtensions.gsconnect
  gnomeExtensions.another-window-session-manager
  gnomeExtensions.vitals
  # gnomeExtensions.freon
  gnomeExtensions.dash-to-panel
  gnomeExtensions.sound-output-device-chooser
  gnomeExtensions.gtk-title-bar
];
#+END_SRC

* Boot loader
 Configure the GRUB 2 bootloader on UEFI with
 #+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
 # Use the GRUB 2 boot loader (with EFI support)
 boot.loader.grub.enable = true;
 boot.loader.grub.version = 2;
 boot.loader.grub.device = "nodev";
 boot.loader.grub.efiSupport = true;
 boot.loader.grub.useOSProber = true;
 boot.loader.grub.fsIdentifier = "label";
 boot.loader.grub.efiInstallAsRemovable = true;
 boot.loader.efi.efiSysMountPoint = "/boot";

 # Use the systemd-boot EFI boot loader.
 # boot.loader.systemd-boot.enable = true;
 # boot.loader.efi.canTouchEfiVariables = true;
 #+END_SRC

** Supporting BTRFS and NTFS File System
If using a BTRFS filesystem add it to ~boot.supportedFilesystems~ and enable
~boot.hardware.enableAllFirmware~
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
boot.supportedFilesystems = [ "btrfs" "ntfs" ];
hardware.enableAllFirmware = true;
#+END_SRC

** Disable ertm
For some reason .. you need to disable ertm to bluetooth pair a xbox controller
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
boot.extraModprobeConfig = '' options bluetooth disable_ertm=1 '';
#+END_SRC

* Kernel
See [[https://nixos.wiki/wiki/Linux_kernel][NixOS Wiki Linux Kernel]] for details on selecting a kernel. If you don't
specify a kernel, it'll default to a the "latest" lts kernel
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
boot.kernelPackages = pkgs.linuxPackages_5_15;
#+END_SRC
** Kernel Modules
Set kernel modules to be loaded here

* Virtual Box
If installing NixOS inside of a virtual box (which is a great way to develop a
config) make sure to enable Guest Additions to get some nice extra features
including much better video support (add this to your hosts ~configuration.nix~)
  #+BEGIN_SRC nix :tangle no 
  virtualisation.virtualbox.guest.enable = true;
  #+END_SRC

* System Settings
** TimeZone
See [[https://en.wikipedia.org/wiki/List_of_tz_database_time_zones][list of tz database time zones]] for possible options
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
time.timeZone = "America/Toronto";
#+END_SRC

** Locale
Use the command ~locale -a~ to see a list of valid locales
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
i18n.defaultLocale = "en_US.UTF-8";
console = {
  font = pkgs.lib.mkForce "sun12x22";
  keyMap = pkgs.lib.mkForce "us";
};
#+END_SRC

** Allow Proprietary Software
Because NixOS is high and mighty Open Source software you need to manually specify
the installation of propriety (unfree) software is allowed (see the
[[https://nixos.wiki/wiki/FAQ/How_can_I_install_a_proprietary_or_unfree_package%3F][NixOS Wiki on Proprietary Packages]])
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
nixpkgs.config.allowUnfree = true;
#+END_SRC

** Fonts
Install fonts by adding them to ~fonts.fonts.pkgs~ (use override to select fonts
from a big package) see [[https://nixos.wiki/wiki/Fonts][NixOS Wiki Fonts]] for details
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
fonts = {
  fonts = with pkgs; [
      dejavu_fonts
      (nerdfonts.override { fonts = [ "DejaVuSansMono" ]; } )
      source-code-pro
      emacs-all-the-icons-fonts
      jetbrains-mono
      font-awesome
      hack-font
      inconsolata
      inconsolata-nerdfont
    ];
};
#+END_SRC

** Keyboard Layout
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.xserver.layout = "us";
#+END_SRC
** Swap Control and Caps
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.xserver.xkbOptions = "ctrl:swapcaps"; # this stopped working on home-manager update. needs to be set through home.keyboard.options now?
#+END_SRC
