common-configuration.nix
  nixpkgs.overlays = let
    # this overlay is just a tmp fix for a steam update issue, track here https://github.com/ValveSoftware/steam-runtime/issues/462
    # remove me when the issue is fixed
    steam-overlay =(self: super: { steam = super.steam.override { extraPkgs = pkgs: with pkgs; [ pango harfbuzz libthai ]; }; } ) ;
    plasma-framework-overly = (final: prev:
      let
        libsForQt5 = prev.libsForQt5.overrideScope' (
          finalx: prevx:
          let
            kdeFrameworks = prevx.kdeFrameworks.overrideScope' (
              finaly: prevy: {
                plasma-framework = prevy.plasma-framework.overrideAttrs (oldAttrs:
                  rec {
                    # NOTE update me as nixpkgs gets updated, see
                    # nixpkgs/pkgs/development/libraries/kde-frameworks/srcs.nix to see current version
                    # and apply fixes in https://github.com/xmonad/xmonad/issues/174
                    src = pkgs.fetchurl {
                      url = "https://github.com/dalvescb/plasma-framework/archive/refs/tags/xmonad-5.90.tar.gz";
                      sha256 = "sha256-8EoNNnSW6nxwyc5h/vR6BnF71c3J2WlZL1ivHfcGsWI=";
                      name = "plasma-framework-5.90.0.tar.gz";
                    };
                  });
              });
            plasma5 = prevx.plasma5;
            kdeGear = prevx.kdeGear;
            all = kdeFrameworks // plasma5 // plasma5.thirdParty // kdeGear;
            libsForQt5 = all // {
              inherit kdeFrameworks plasma5 kdeGear;
              kdeApplications = kdeGear;
            };
          in libsForQt5 // {
            inherit libsForQt5;
          });
      in { inherit libsForQt5;
            inherit (libsForQt5) plasma-desktop;
            plasma5Packages = libsForQt5;
          }
    );
    hls-overlay = (self: super:
      let
        disableCabalFlag = super.haskell.lib.disableCabalFlag;
  
        hslWithoutPlugins = super.haskellPackages.haskell-language-server.override  {
          hls-fourmolu-plugin = null;
          hls-ormolu-plugin = null;
          # supportedGhcVersions = [ "884" "8107" "90" ];
        };
        withoutFourmoluFlag = disableCabalFlag hslWithoutPlugins "fourmolu";
        hls = disableCabalFlag withoutFourmoluFlag "ormolu";
      in { haskell-language-server = hls;  } );
  # in [ plasma-framework-overly ];
  in [ ];  # use no overlays atm
  environment.systemPackages = with pkgs; [
    wget
    ispell
    vim
    emacs
    git
    imagemagick
    subversion
    firefox-bin
    chromium
    brave
    discord
    nix-index
    libva
    libva-utils
    razergenie
    linuxPackages_5_15.openrazer
    pciutils
    arc-kde-theme
    # plasma5.kwallet-pam
    # plasma5.sddm-kcm
    haskellPackages.stack
    # (haskell-language-server.override { supportedGhcVersions = [ "902" "924" ]; })
    haskell-language-server
    haskellPackages.Cabal-syntax
    haskellPackages.Agda
    haskellPackages.implicit-hie
    cabal-install
    ghc
    python3Full
    snapper
    python38Packages.setuptools
    # emacs26Packages.agda2-mode
    agda
    agda-pkg
    texlive.combined.scheme-full
    # alacritty
    libsForQt5.ark
    zip
    unzip
    unrar
    mattermost-desktop
    slack
    teams
    zoom-us
    snapper
    # steam
    # steam-run
    chntpw
    ntfs3g
    libsForQt5.plasma-integration
    libsForQt5.plasma-browser-integration
    # libsForQt5.kdeconnect-kde
    libsForQt5.okular
    xorg.xkill
    htop
    linuxPackages_5_15.xpadneo
    gsmartcontrol
    smartmontools
    pkg-config
    alsa-lib
    xorg.xrandr
    arandr
    killall
    libnotify
    jupyter
    pandoc
    libreoffice
    rnnoise-plugin
    noisetorch
    vulkan-tools
    vulkan-loader
    vulkan-validation-layers
    python311Packages.pygments
    ipopt
    docker
    # haskell.packages.ghc883.haskell-language-server
    glmark2
    ripgrep
    ripgrep-all
    # dropbox - we don't need this in the environment. systemd unit pulls it in
    dropbox-cli
    nodePackages.mermaid-cli
    graphviz
    xdot
    haskellPackages.graphmod
    obs-studio
    vlc
    haruna
    mkvtoolnix
    niv
    shotcut
    gnome.nautilus
    gnome.sushi
    scrot
    btop
    lm_sensors
    xsensors
    hddtemp
    kde-gtk-config
    arc-theme
    materia-theme
    orchis-theme
    libsForQt5.knotifications
    libsForQt5.sddm-kcm
    libsForQt5.konqueror
    rnix-lsp
    spotify
    webtorrent_desktop
    transmission-qt
    kgraphviewer
    libgtop
    etcher
    openrgb
    poppler
    ditaa
    texlab
    ltex-ls
    html-tidy
    dolphin-emu
    sqlite
    elmPackages.elm
    elmPackages.nodejs
    elmPackages.elm-language-server
    elmPackages.elm-test
    elmPackages.elm-format
    elmPackages.elm-json
    elmPackages.elm-review
    elmPackages.elm-live
    elm2nix
    thunderbird
    gnome-icon-theme
    gnome.gnome-tweaks
    gnome.dconf-editor
    gnomeExtensions.appindicator
    gnomeExtensions.just-perfection
    gnomeExtensions.gsconnect
    gnomeExtensions.another-window-session-manager
    gnomeExtensions.vitals
    # gnomeExtensions.freon
    gnomeExtensions.dash-to-panel
    gnomeExtensions.sound-output-device-chooser
    gnomeExtensions.gtk-title-bar
  ];
  # Use the GRUB 2 boot loader (with EFI support)
  boot.loader.grub.enable = true;
  boot.loader.grub.version = 2;
  boot.loader.grub.device = "nodev";
  boot.loader.grub.efiSupport = true;
  boot.loader.grub.useOSProber = true;
  boot.loader.grub.fsIdentifier = "label";
  boot.loader.grub.efiInstallAsRemovable = true;
  boot.loader.efi.efiSysMountPoint = "/boot";
  
  # Use the systemd-boot EFI boot loader.
  # boot.loader.systemd-boot.enable = true;
  # boot.loader.efi.canTouchEfiVariables = true;
  boot.supportedFilesystems = [ "btrfs" "ntfs" ];
  hardware.enableAllFirmware = true;
  boot.extraModprobeConfig = '' options bluetooth disable_ertm=1 '';
  boot.kernelPackages = pkgs.linuxPackages_5_15;
  time.timeZone = "America/Toronto";
  i18n.defaultLocale = "en_US.UTF-8";
  console = {
    font = pkgs.lib.mkForce "sun12x22";
    keyMap = pkgs.lib.mkForce "us";
  };
  nixpkgs.config.allowUnfree = true;
  fonts = {
    fonts = with pkgs; [
        dejavu_fonts
        # (nerdfonts.override { fonts = [ "DejaVuSansMono" ]; } )
        nerdfonts
        source-code-pro
        emacs-all-the-icons-fonts
        jetbrains-mono
        font-awesome
        hack-font
        inconsolata
        inconsolata-nerdfont
      ];
  };
  services.xserver.layout = "us";
  services.xserver.xkbOptions = "ctrl:swapcaps"; # this stopped working on home-manager update. needs to be set through home.keyboard.options now?
  environment.variables =
    {
