NixOSConfiguration.org
** Global Environment Variables
Set global environment variables (to be initialized in /etc/profile) here
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
environment.variables =
  {
    # In firefox in about:config I switched gfx.webrender.all to true to fix bug causing
    # lag under high gpu load. 
    # But this introduced a new bug! that is fixed by this environment variable
    MOZ_X11_EGL = "1";
    HOSTNAME = "${config.networking.hostName}";
    XDG_SESSION_TYPE="x11";
    # needed to fix bug https://github.com/NixOS/nixpkgs/issues/48424
    WEBKIT_DISABLE_COMPOSITING_MODE = "1";
  };
#+END_SRC
** Systemd 
Set an extra variables usually set in ~/etc/systemd/system.conf~ here
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
systemd.extraConfig = ''
                    DefaultTimeoutStopSec=5s
                    DefaultTimeoutStartSec=5s
                    '';
#+END_SRC

* Cron
See [[https://nixos.wiki/wiki/Cron]] for details on configuring NixOS for cron
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.cron = {
  enable = true;
  systemCronJobs = [
      # updates ip for duckdns
      "*/5 * * * * root /home/dalvescb/duckdns/duck.sh >/dev/null 2>&1"
    ];
};
#+END_SRC

* OpenSSH
Enable OpenSSH server here. NOTE you can authorize public keys for users by adding
~users.users.USERNAME.openssh.authroizedKeys.keys = [ "PUBLIC KEY STRING" ];~ to
host specific configuration file
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.openssh.enable = true;
#+END_SRC

* Networking
- The hostname and DHCP settings should already be set in your
  ~configuration.nix~ (see [[#multi-system-file-layout][Multi-System File Layout]])
- Enable network manager with
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
networking.networkmanager.enable = true;
#+END_SRC

** Firewall
Open TCP/UDP ports on which incoming connects are accepted:
  - *KDE Connect* ports: 1714-1764
  - *Dropbox* ports: 17500
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
networking.firewall.allowedTCPPortRanges = [
  # KDE Connect
  {
    from = 1714;
    to = 1764;
  }
  # Dropbox
  {
    from = 17500;
    to = 17500;
  }
  # SSH
  {
    from = 22;
    to = 22;
  } 
];

networking.firewall.allowedUDPPortRanges = [
  # KDE Connect
  {
    from = 1714;
    to = 1764;
  }
  # Dropbox
  {
    from = 17500;
    to = 17500;
  }
  # SSH
  {
    from = 22;
    to = 22;
  }
];
#+END_SRC

* Graphics
Because graphics drivers vary from system to system, I put the configuration for
them in their own modules (separate from the ~common-configuration.nix~ file the
rest of this document generates. The two main configurations I have are
- ~nvidia.nix~ standard proprietary nvidia driver that uses just a discrete gpu
- ~nvidiaprime.nix~
** Nvidia
A simple setup for a dedicated nvidia MXM card can be done via the following
configuration
#+BEGIN_SRC nix :tangle nvidia.nix
{pkgs, ... }:

{
  services.xserver.videoDrivers = [ "nvidia" ];
  # services.xserver.dpi = 96;
  hardware.opengl = {
    enable = true;
    extraPackages = with pkgs; [
        vaapiIntel
        vaapiVdpau
        libvdpau-va-gl
      ];
    setLdLibraryPath = true;
    driSupport = true;
    driSupport32Bit = true;
  };
}
#+END_SRC

** Nvidia Prime
For a laptop with dedicated and integrated graphics, you can operate in hybrid
mode (to get the power of the dedicated gpu when necessary and power saving with
integrated) using Nvidia Optimus via the following configuration
#+BEGIN_SRC nix :tangle nvidiaprime.nix
{pkgs, ... }:

{
  # environment.systemPackages = [ nvidia-offload ]; 
  # services.xserver.videoDrivers = [ "intel" "modesetting" "nvidia" ];
  services.xserver.videoDrivers = [ "nvidia" ];
  services.xserver.dpi = 96;
  hardware.nvidia.prime = {
    # offload.enable = true;
    sync.enable = true;
    # Bus ID of the Intel GPU. You can find it using lspci, either under 3D or VGA
    intelBusId = "PCI:0:2:0";

    # Bus ID of the NVIDIA GPU. You can find it using lspci, either under 3D or VGA
    nvidiaBusId = "PCI:1:0:0";
  };
  hardware.opengl = {
    enable = true;
    extraPackages = with pkgs; [
        vaapiIntel
        vaapiVdpau
        libvdpau-va-gl
      ];
  };
  hardware.opengl.driSupport32Bit = true;
}
#+END_SRC
*NOTE* it requires ~nixpkgs.config.allowUnfree~ enabled (see [[#allow-proprietary-software][Allow Proprietary Software]])

* Desktop Environment
** Gnome 3
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.xserver.enable = true;
services.xserver.displayManager.gdm.enable = true;
services.xserver.desktopManager.gnome.enable = true;

services.dbus.packages = [ pkgs.dconf ];
services.udev.packages = with pkgs; [ gnome.gnome-settings-daemon ];
#+END_SRC

** KDE Plasma5
#+BEGIN_SRC nix :tangle no
services.xserver.enable = true;
# services.xserver.displayManager.lightdm.enable = true;
services.xserver.displayManager.sddm.enable = true;
services.xserver.desktopManager.plasma5.enable = true;

# services.xserver.displayManager.defaultSession = "none+xmonad";
services.xserver.windowManager.xmonad = {
    enable = true;
    enableContribAndExtras = true;
  };
#+END_SRC

Global Theme doesn't seem to work (for downloading/installing new themes) but
- You can download new themes from the [[https://store.kde.org][KDE Store]] (say ~Sweet.tar.xz~) and
  install them (mutably) with
  #+BEGIN_SRC shell :tangle no
  kpackagetool5 -t Plasma/LookAndFeel -i Sweet.tar.xz
  #+END_SRC
- This installs the theme in ~$HOME/.local/share/plasma/look-and-feel~
- To switch the theme on, either edit ~$HOME/.config/plasmarc~ manually or do so
  with 
  #+BEGIN_SRC shell :tangle no
  kwriteconfig5 --key Theme Sweet
  #+END_SRC

** None + Xmonad
#+BEGIN_SRC nix :tangle no 
services = {
  gnome.gnome-keyring.enable = true;
  gnome.sushi.enable = true;
  upower.enable = true;
  
  dbus = {
    enable = true;
    packages = [ pkgs.gnome.dconf ];
  };

  xserver.enable = true;

  xserver.displayManager.defaultSession = "none+xmonad";

  xserver.windowManager.xmonad = {
    enable = true;
    enableContribAndExtras = true;
  };
};

console.useXkbConfig = true;
systemd.services.upower.enable = true;
#+END_SRC

* Bluetooth
Enable bluetooth support with one simple line (see
[[https://nixos.wiki/wiki/Bluetooth][NixOS Wiki Bluetooth]] for further details)
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
hardware.bluetooth.enable = true;
services.blueman.enable = true;
hardware.bluetooth.settings = {
  General = {
    Enable = "Source,Sink,Media,Socket";
    };
};
#+END_SRC
The ~hardware.bluetooth.settings~ was suggested for enabling the A2DP profile
for headsets in the wiki, although it might not be necessary

* Sounds Settings
Standard sound support is enabled through [[https://nixos.wiki/wiki/PulseAudio][Pulse Audio]].

However, I have switched to [[https://nixos.wiki/wiki/PipeWire][Pipewire]] as it seems to be less buggy with bluetooth
headsets. I've left my previous pulse audio configuration commented out
 #+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
 sound.enable = true;
 # hardware.pulseaudio = {
 #    enable = true;
 #    support32Bit = true;
 #    # NixOS allows either a lightweight build (default) or full build of PulseAudio to be installed.
 #    # Only the full build has Bluetooth support, so it must be selected here.
 #    package = pkgs.pulseaudioFull;
 # };
 hardware.pulseaudio.enable = false;
 security.rtkit.enable = true;
 services.pipewire = {
  enable = true;
  alsa.enable = true;
  alsa.support32Bit = true;
  pulse.enable = true;
  # If you want to use JACK applications, uncomment this
  #jack.enable = true;
 };
 #+END_SRC
 You may also need to add users to the ~audio~ group (see [[#users-management][Users Management]])

* TouchPad support
To enable touchpad support through [[https://wiki.archlinux.org/index.php/Libinput][LibInput]] add
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.xserver.libinput.enable = true;
#+END_SRC

** Xbox controller support
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
hardware.xpadneo.enable = true;
#+END_SRC

* Shell Environment
Enable the default shell (i.e. bash,zhs,fish,etc) here
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
programs.zsh.enable = true;
programs.fish.enable = true;
#+END_SRC
To set the default shell see the next section ([[#users-management][Users Management]])

* Users Management
I like to declaretively set my user configurations, including their password via
a ~hashedPassword~. Because of this, I keep my user configuration in a seperate
file ~user-configuration.nix~ that I import and do not include in this document
or GitHub repo.

An example of this file is
#+BEGIN_SRC nix :tangle no 
{ config, pkgs, ... }:

{
  users.mutableUsers = false;

  users.users.dalvescb = {
    isNormalUser = true;
    home = "/home/dalvescb";
    extraGroups = [ "wheel" "networkmanager" ]; 
    shell = pkgs.zsh;
    hashedPassword = "asdl;fkjasdfnamsdcoimalkamxzcOIUZlknasdfkdf";
          # generate me with mkpasswd -m sha-512
  };

  # disable root password
  users.users.root.hashedPassword = "*";
}
#+END_SRC

* Open Razer
In order to use *razergenie* (installed in [[#system-packages][System Packages]]) to configure rgb for
razer peripherals, you need to enable the open razer daemon with
#+BEGIN_SRC nixos :tangle no :noweb-ref insert-config-here
hardware.openrazer.enable = true;
#+END_SRC
You also need to add your user to the ~plugdev~ group in your user configuration
(see  [[#users-management][Users Management]])

* Emacs Daemon
To install and enable the systemd user service for the Emacs daemon, add the
following
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
services.emacs.enable = true;
services.emacs.defaultEditor = true;
#+END_SRC

* Steam
To fix an issue with proton 5.13, steam now needs to be installed as a service
(for the foreseeable future?), and not in ~environment.system-packages~. See the
following [[https://github.com/NixOS/nixpkgs/pull/114024][pull request]] for details
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
programs.steam.enable = true;
#+END_SRC

* Gamemode
Gamemode is a daemon/lib for linux that allows games to request a set of
optimizations to be temporarily applied. Will generally be used with steam by
adding the launch option ~gamemoderun %command$~
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
programs.gamemode.enable = true;
#+END_SRC

* Dropbox
Unfortunately there's no Dropbox module in nixpkgs, however the [[https://nixos.wiki/wiki/Dropbox][NixOS
Wiki on Dropbox]] provides instructions for adding support via a service like so
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
systemd.user.services.dropbox = {
    description = "Dropbox";
    wantedBy = [ "graphical-session.target" ];
    environment = {
      QT_PLUGIN_PATH = "/run/current-system/sw/" + pkgs.qt5.qtbase.qtPluginPrefix;
      QML2_IMPORT_PATH = "/run/current-system/sw/" + pkgs.qt5.qtbase.qtQmlPrefix;
    };
    serviceConfig = {
      ExecStart = "${pkgs.dropbox.out}/bin/dropbox";
      ExecReload = "${pkgs.coreutils.out}/bin/kill -HUP $MAINPID";
      KillMode = "control-group"; # upstream recommends process
      Restart = "on-failure";
      PrivateTmp = true;
      ProtectSystem = "full";
      Nice = 10;
    };
  };
#+END_SRC

* NoiseTorch
[[https://github.com/lawl/NoiseTorch][NoiseTorch]] is a real-time noise suppressor for Linux that works with PulseAudio
or Pipewire (it requires the setcap wrapper to run properly and thus needs to be
enabled as a service)
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
programs.noisetorch.enable = true;
#+END_SRC

