common-configuration.nix
      # In firefox in about:config I switched gfx.webrender.all to true to fix bug causing
      # lag under high gpu load. 
      # But this introduced a new bug! that is fixed by this environment variable
      MOZ_X11_EGL = "1";
      HOSTNAME = "${config.networking.hostName}";
      XDG_SESSION_TYPE="x11";
      # needed to fix bug https://github.com/NixOS/nixpkgs/issues/48424
      WEBKIT_DISABLE_COMPOSITING_MODE = "1";
    };
  systemd.extraConfig = ''
                      DefaultTimeoutStopSec=5s
                      DefaultTimeoutStartSec=5s
                      '';
  services.cron = {
    enable = true;
    systemCronJobs = [
        # updates ip for duckdns
        "*/5 * * * * root /home/dalvescb/duckdns/duck.sh >/dev/null 2>&1"
      ];
  };
  services.openssh.enable = true;
  networking.networkmanager.enable = true;
  networking.firewall.allowedTCPPortRanges = [
    # KDE Connect
    {
      from = 1714;
      to = 1764;
    }
    # Dropbox
    {
      from = 17500;
      to = 17500;
    }
    # SSH
    {
      from = 22;
      to = 22;
    } 
  ];
  
  networking.firewall.allowedUDPPortRanges = [
    # KDE Connect
    {
      from = 1714;
      to = 1764;
    }
    # Dropbox
    {
      from = 17500;
      to = 17500;
    }
    # SSH
    {
      from = 22;
      to = 22;
    }
  ];
  services.xserver.enable = true;
  services.xserver.displayManager.gdm.enable = true;
  services.xserver.desktopManager.gnome.enable = true;
  
  services.dbus.packages = [ pkgs.dconf ];
  services.udev.packages = with pkgs; [ gnome.gnome-settings-daemon ];
  hardware.bluetooth.enable = true;
  services.blueman.enable = true;
  hardware.bluetooth.settings = {
    General = {
      Enable = "Source,Sink,Media,Socket";
      };
  };
  sound.enable = true;
  # hardware.pulseaudio = {
  #    enable = true;
  #    support32Bit = true;
  #    # NixOS allows either a lightweight build (default) or full build of PulseAudio to be installed.
  #    # Only the full build has Bluetooth support, so it must be selected here.
  #    package = pkgs.pulseaudioFull;
  # };
  hardware.pulseaudio.enable = false;
  security.rtkit.enable = true;
  services.pipewire = {
   enable = true;
   alsa.enable = true;
   alsa.support32Bit = true;
   pulse.enable = true;
   # If you want to use JACK applications, uncomment this
   #jack.enable = true;
  };
  services.xserver.libinput.enable = true;
  hardware.xpadneo.enable = true;
  programs.zsh.enable = true;
  programs.fish.enable = true;
  hardware.openrazer.enable = true;
  services.emacs.enable = true;
  services.emacs.defaultEditor = true;
  programs.steam.enable = true;
  programs.gamemode.enable = true;
  systemd.user.services.dropbox = {
      description = "Dropbox";
      wantedBy = [ "graphical-session.target" ];
      environment = {
        QT_PLUGIN_PATH = "/run/current-system/sw/" + pkgs.qt5.qtbase.qtPluginPrefix;
        QML2_IMPORT_PATH = "/run/current-system/sw/" + pkgs.qt5.qtbase.qtQmlPrefix;
      };
      serviceConfig = {
        ExecStart = "${pkgs.dropbox.out}/bin/dropbox";
        ExecReload = "${pkgs.coreutils.out}/bin/kill -HUP $MAINPID";
        KillMode = "control-group"; # upstream recommends process
        Restart = "on-failure";
        PrivateTmp = true;
        ProtectSystem = "full";
        Nice = 10;
      };
    };
  programs.noisetorch.enable = true;
