NixOSConfiguration.org
* Nix.conf
These settings will configure settings int ~/etc/nix/nix.conf~

#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
nix.settings.trusted-public-keys = [
  "hydra.iohk.io:f/Ea+s+dFdN+3Y/G+FDgSq+a5NEWhJGzdjvKNGv0/EQ=" # Binary Cache for Haskell.nix
];

nix.settings.substituters = [
  "https://cache.iog.io" # Binary Cache for Haskell.nix
];

#  this was added to fix the following error when using buildStackProject
# error: derivation '/nix/store/5sdvfa4fg9rsrqnl120ji9gnn6fa15gc-Coconut-env.drv' has '__noChroot' set, but that's not allowed when 'sandbox' is 'true'
nix.settings.sandbox = false;
#+END_SRC

* Nix Extra Options
The following extra options are needed by Home Manager for nix-direnv (see the
[[https://github.com/nix-community/nix-direnv][direnv github]] for details
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
nix.extraOptions = ''
                 keep-outputs = true
                 keep-derivations = true
                 '';
#+END_SRC
* Nix Permitted Insecure Packages
Add any packages marked as insecure that you want to build here anyways
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
nixpkgs.config.permittedInsecurePackages = [
                "electron-12.2.3"
              ];
#+END_SRC
* System Upgrades
Configure how System Upgrades are performed here
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
# enables auto-updating
system.autoUpgrade.enable = false;
system.autoUpgrade.allowReboot = false;

# This value determines the NixOS release from which the default
# settings for stateful data, like file locations and database versions
# on your system were taken. It‘s perfectly fine and recommended to leave
# this value at the release version of the first install of this system.
# Before changing this value read the documentation for this option
# (e.g. man configuration.nix or on https://nixos.org/nixos/options.html).
system.stateVersion = "20.09"; # Did you read the comment?
#+END_SRC

* Opt-In State
If you followed the formatting laid out in [[#formatting-for-luks-encryption-on-btrfs][Formatting for LUKS Encryption on
BTRFS]],
(i.e. you should have a BTRFS filesystem with the following subvolumes)
 - root ~/~
 - home ~/home~
 - nix ~/nix~
 - persist ~/persist~
 - log ~/var/log~
then it's possible to setup the root subvolume to restore to a snapshot
automatically each boot. This gives you a nice "clean OS smell" each time you
boot. The article [[https://mt-caret.github.io/blog/posts/2020-06-29-optin-state.html][Encypted Btrfs Root with Opt-in State on NixOS]] gives a good
overview of how to go about this.

Of course this comes at a cost, mainly sometimes you'll want certain files to
persist which will require extra work copying and symlinking to the ~persist~
subvolume

** Figuring out what to Persist
To figure out which files you may want to persist, you'll probably want to take a
diff of files that have changes from your current (in use) root partition and
the blank snapshot. To do this:
- First mount the root subvolume with
  #+BEGIN_SRC sh :tangle no
  sudo mkdir /mnt
  sudo mount -o subvol=/ /dev/mapper/enc /mnt
  ./fs-diff.sh
  #+END_SRC
- Then execute the following script
  #+BEGIN_SRC sh :tangle no
  #!/usr/bin/env bash
  # fs-diff.sh
  set -euo pipefail

  OLD_TRANSID=$(sudo btrfs subvolume find-new /mnt/root-blank 9999999)
  OLD_TRANSID=${OLD_TRANSID#transid marker was }

  sudo btrfs subvolume find-new "/mnt/root" "$OLD_TRANSID" |
  sed '$d' |
  cut -f17- -d' ' |
  sort |
  uniq |
  while read path; do
    path="/$path"
    if [ -L "$path" ]; then
      : # The path is a symbolic link, so is probably handled by NixOS already
    elif [ -d "$path" ]; then
      : # The path is a directory, ignore
    else
      echo "$path"
    fi
  done
  #+END_SRC

** Persisting Files #REMOVED
We copy files/directories in ~/etc/~ to their own spot in ~/persist/etc/~ to
make them persist (~/etc/nixos~ is a good example of a directory we need to do
this with) and use systemd's [[https://www.freedesktop.org/software/systemd/man/tmpfiles.d.html][tmpfiles.d]] to symlink files as necessary 
#+BEGIN_SRC nix :tangle no
environment.etc = {
  # persist /etc/nixos
  nixos.source = "/persist/etc/nixos";
  NIXOS.source = "/persist/etc/NIXOS";
  # persist NetworkManager 
  "NetworkManager/system-connections".source = "/persist/etc/NetworkManager/system-connections";
  # persist adjtime
  # adjtime.source = "/persist/etc/adjtime";
};

systemd.tmpfiles.rules = [
 "L /var/lib/NetworkManager/secret_key - - - - /persist/var/lib/NetworkManager/secret_key"
 "L /var/lib/NetworkManager/seen-bssids - - - - /persist/var/lib/NetworkManager/seen-bssids"
 "L /var/lib/NetworkManager/timestamps - - - - /persist/var/lib/NetworkManager/timestamps"
 "L /var/lib/bluetooth - - - - /persist/var/lib/bluetooth"
];

security.sudo.extraConfig = ''
  # rollback results in sudo lectures after each reboot
  Defaults lecture = never
'';
#+END_SRC

*NOTE* the first time you add something to ~/persist~ you still need to manually
 copy them (see [[#copying-files-to-persist][Copying Files to Persist]])

*** Persisting Machine-ID
- The file ~/etc/machine-id~ is blank on first boot but then is given a unique
  value corresponding to your machine-id. We need to persist this for certain
  functionality (including persisting ~journald~ entries).
- *AFTER FIRST BOOT* add the following to your hosts ~configuration.nix~
  #+BEGIN_SRC nix :tangle no
  environment.etc."machine-id".text = "b7665d1914cd41dc93406d8488004eb0";
  #+END_SRC
- *WHERE* the above code is the generated machine-id inside ~/etc/machine-id~
  after first boot
- *NOTE* because this is unique to different hosts this isn't generated by this
  document in ~common-configuration.nix~, it must be added to
  ~configuration.nix~ manually
  
** Root Rollback #REMOVED
Finally, we need to configure NixOS to rollback the root subvolume (to our
root-blank snapshot) on boot
#+BEGIN_SRC nix :tangle no
# Note `lib.mkBefore` is used instead of `lib.mkAfter` here.
boot.initrd.postDeviceCommands = pkgs.lib.mkBefore ''
  mkdir -p /mnt

  # We first mount the btrfs root to /mnt
  # so we can manipulate btrfs subvolumes.
  mount -o subvol=/ /dev/mapper/enc /mnt

  # While we're tempted to just delete /root and create
  # a new snapshot from /root-blank, /root is already
  # populated at this point with a number of subvolumes,
  # which makes `btrfs subvolume delete` fail.
  # So, we remove them first.
  #
  # /root contains subvolumes:
  # - /root/var/lib/portables
  # - /root/var/lib/machines
  #
  # I suspect these are related to systemd-nspawn, but
  # since I don't use it I'm not 100% sure.
  # Anyhow, deleting these subvolumes hasn't resulted
  # in any issues so far, except for fairly
  # benign-looking errors from systemd-tmpfiles.
  btrfs subvolume list -o /mnt/root |
  cut -f9 -d' ' |
  while read subvolume; do
    echo "deleting /$subvolume subvolume..."
    btrfs subvolume delete "/mnt/$subvolume"
  done &&
  echo "deleting /root subvolume..." &&
  btrfs subvolume delete /mnt/root

  echo "restoring blank /root subvolume..."
  btrfs subvolume snapshot /mnt/root-blank /mnt/root

  # Once we're done rolling back to a blank snapshot,
  # we can unmount /mnt and continue on the boot process.
  umount /mnt
'';
#+END_SRC

** Copying Files to Persist
NixOS will take care of creating the specified symlinks, but we still need to
manually move relevant files we adding them to ~/persist~ for the first time,
i.e. after the previous steps run
#+BEGIN_SRC shell :tangle no 
sudo nixos-rebuild boot

# persist NetworkManager
sudo mkdir -p /persist/etc/NetworkManager
sudo cp -r {,/persist}/etc/NetworkManager/system-connections
sudo mkdir -p /persist/var/lib/NetworkManager
sudo cp /var/lib/NetworkManager/{secret_key,seen-bssids,timestamps} /persist/var/lib/NetworkManager/
# persist nixos
sudo cp -r {,/persist}/etc/nixos
sudo cp -r {,/persist}/etc/NIXOS
# persist adjtime
sudo cp {,/persist}/etc/adjtime
# copy bluetooth
sudo cp -r /var/lib/bluetooth /persist/var/lib/
#+END_SRC

* Home Manager
NixOS configurations aren't designed to generate user-specific configurations
(i.e. user installed packages or config files located in ~$HOME~. To do this we
need the [[https://rycee.gitlab.io/home-manager/][Home Manager]] add on
#+BEGIN_SRC nix :tangle no :noweb yes :noweb-ref insert-config-here
home-manager.users.dalvescb = { pkgs, config, ... }: {
  nixpkgs.config.allowUnfree = true;
  home.stateVersion = "20.09";
  home.packages = with pkgs; [
    gimp
    pavucontrol
    xorg.xmessage
    nitrogen
    font-awesome
    # font-awesome-ttf      # used by polybar
    material-design-icons # used by polybar
    xmonad-log
    pasystray
    blueman
    networkmanagerapplet
    networkmanager_dmenu
    dmenu
    # (pkgs.linkFarm "dmenu" [ {
    #   name = "bin/dmenu";
    #   path = "${pkgs.rofi}/bin/rofi";
    # } ])
    gnome.adwaita-icon-theme
    # dunst
    arc-icon-theme
    steam-run
    dconf2nix
    alacritty
  ];
  
  <<insert-home-here>>
  
};
#+END_SRC
*NOTE*: You need to import home-manager before using it (see [[#imports][Imports]]). All the
 following home-manager specific configurations are inserted into ~<<insert-home-here>>~

** Shell Configuration
I use zsh with a couple of non-standard plugins
which have to be fetched manually from GitHub, including:
  - [[https://github.com/zsh-users/zsh-autosuggestions][ZSH Autosuggestions]]
  - [[https://github.com/zsh-users/zsh-syntax-highlighting][ZSH Syntax Highlighting]]
    
#+BEGIN_SRC nix :tangle no :noweb-ref insert-home-here
programs.zsh.enable = true;
programs.zsh.oh-my-zsh.enable = true;
programs.zsh.oh-my-zsh.plugins = [ "git" ];
programs.zsh.oh-my-zsh.theme = "amuse";

programs.zsh.plugins = let
  zsh-syntax-highlighting = {
     name = "zsh-syntax-highlighting";
     src = pkgs.fetchFromGitHub {
       owner = "zsh-users";
       repo = "zsh-syntax-highlighting";
       rev = "0.7.1";
       sha256 = "03r6hpb5fy4yaakqm3lbf4xcvd408r44jgpv4lnzl9asp4sb9qc0";
     };
   };
  zsh-autosuggestions = {
     name = "zsh-autosuggestions";
     src = pkgs.fetchFromGitHub {
       owner = "zsh-users";
       repo = "zsh-autosuggestions";
       rev = "v0.6.4";
       sha256 = "0h52p2waggzfshvy1wvhj4hf06fmzd44bv6j18k3l9rcx6aixzn6";
     };
   };
  in [ 
      zsh-syntax-highlighting
      zsh-autosuggestions
     ];
#+END_SRC

*** Shell Aliases
Instead of in .profile, .bash, etc create aliases declaratively here 
#+BEGIN_SRC nix :tangle no :noweb-ref insert-config-here
programs.zsh.shellAliases = { 
  e = "emacsclient";
  ec ="emacsclient -c";
};
#+END_SRC

** Alacritty
Configuration of the Alacritty terminal emulator (see [[https://github.com/alacritty/alacritty/blob/master/alacritty.yml][Default Alacritty Config
File]] for configuration options)
#+BEGIN_SRC nix :tangle no :noweb-ref insert-home-here
programs.alacritty.enable = true;
programs.alacritty.settings = {
  window.opacity = 1.0;
  font.normal = {
    family = "Source Code Pro";
    style = "Regular";
  };
  font.bold = {
    family = "Source Code Pro";
    style = "Bold";
  };
  font.italic = {
    family = "Source Code Pro";
    style = "Italic";
  };
  font.bold_italic = {
    family = "Source Code Pro";
    style = "Bold Italic";
  };
  font.size = 14.0;
  import = [ "~/nixconfig/alacritty/dracula.yml" ];
  key_bindings = [
    {
      key = "N";
      mods = "Control|Shift";
      action = "SpawnNewInstance";
    }
  ];
};
#+END_SRC

** Nix-Direnv
A fast, persistent implementation of direnv's use-nix, see [[https://github.com/nix-community/nix-direnv][nix-direnv]] for
details
#+BEGIN_SRC nix :tangle no :noweb-ref insert-home-here
programs.direnv.enable = true;
programs.direnv.nix-direnv.enable = true;
#+END_SRC

** dconf Config (Gnome)
Dump current dconf settings with ~dconf dump / > dconf-backup~ 
#+BEGIN_SRC nix :tangle no :noweb-ref insert-home-here
# dconf.settings = {

#   "desktop/wm/keybindings" = { 
#       "close"= "['<Shift><Super>c']";
#       "cycle-windows"= "['<Super>o']";
#       "cycle-windows-backward"= "['<Shift><Super>o']";
#       "maximize"="@as []";
#       "minimize"="@as []";
#       "move-to-monitor-left"= "['<Shift><Super>j']";
#       "move-to-monitor-right"= "['<Shift><Super>k']";
#       "move-to-workspace-1"= "['<Shift><Super>exclam']";
#       "move-to-workspace-2"= "['<Shift><Super>at']";
#       "move-to-workspace-3"= "['<Shift><Super>numbersign']";
#       "move-to-workspace-4"= "['<Shift><Super>dollar']";
#       "move-to-workspace-left"= "['<Shift><Super>h']";
#       "move-to-workspace-right"= "['<Shift><Super>l']";
#       "switch-input-source"= "@as []";
#       "switch-input-source-backward"= "@as []";
#       "switch-to-workspace-1"= "['<Super>1']";
#       "switch-to-workspace-2"= "['<Super>2']";
#       "switch-to-workspace-3"= "['<Super>3']";
#       "switch-to-workspace-4"= "['<Super>4']";
#       "switch-to-workspace-left"= "['<Super>h']";
#       "switch-to-workspace-right"= "['<Super>l']";
#       "toggle-fullscreen"= "['<Shift><Super>space']";
#       "toggle-maximized"= "['<Super>i']";
#     };
  
#     "mutter/keybindings" = {
#       "switch-monitor" = "['XF86Display']";
#       "toggle-tiled-left" = "['<Super>j']";
#       "toggle-tiled-right" = "['<Super>k']";
#     };
  
#     "settings-daemon/plugins/media-keys" = {
#       "screensaver" = "@as []";
#       "search" = "['<Super>p']";
#     };
#   };
#+END_SRC

